snlkuharlocal/src/Documents/ПредварительныйЗаказКлиента/ПредварительныйЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПредварительныйЗаказКлиента</name>
  <comment>https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2474</comment>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузкаКомплектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаказКлиентаFBS</types>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>СекторХранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодтвержденнаяЗаявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПосредника</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезБонуса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоБезБонуса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>56</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>56</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрефиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>56</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуффиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>56</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РИД</name>
      <comment>идентификатор вайлдб. для обмена.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>56</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеУКлиента</name>
      <type>
        <types>CatalogRef.СостояниеНакладнойУКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаОтработана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛогистСервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркОфис</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркСклад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереданоНаСайт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплектующих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПоЮрЛицу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>56</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РИД</name>
      <comment>идентификатор вайлдб. для обмена.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>56</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/РезервыТМЦ/РезервыТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПредварительныйЗаказКлиента</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ВиртуальныйРезерв</types>
      <types>DocumentRef.ЗаявкаНаПерепаковку</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/ПредварительныйЗаказКлиента/ObjectModule.bsl
#Область ОписаниеПеременных

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем МаркетПлейс;
Перем РеквизитыМаркетПлейс;

#КонецЕсли

#КонецОбласти

#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Не ОбменМаркетПлейсПИ.КонтрагентУчастникМаркетПлейса(Контрагент, ПунктДоставки) Тогда
		Отказ = Истина;
		
		СообщитьИзМодуля("Контрагент не является участником интернет продаж!");
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И (Склад = Справочники.Склады.ПустаяСсылка()
		Или СкладПолучатель = Справочники.Склады.ПустаяСсылка()) Тогда
		Отказ = Истина;
		
		СообщитьИзМодуля("Не заполнен склад или склад получателя!");
	КонецЕсли;
	
	РеквизитыМаркетПлейс = ОбменМаркетПлейсПИ.ЗаполнитьДанныеМаркетПлейсаПоКонтрагенту(Контрагент, ПунктДоставки);
	МаркетПлейс = РеквизитыМаркетПлейс.Ссылка;
	
	ЗаполнитьКоличествоПродукции();
	
КонецПроцедуры

// Экспорт обработчика нужен для плана обмена
// @skip-check module-structure-method-in-regions
// 
// Параметры:
//  Отказ - Булево - Отказ
//  РежимПроведения - РежимПроведенияДокумента - Режим проведения
Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	Движения.РезервыТМЦ.Очистить();
	Движения.РезервыТМЦ.БлокироватьДляИзменения = Истина;
	Движения.РезервыТМЦ.Записывать = Истина;

	//Валетов + 03,12,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8062
	//Добавил документ в измерение Заказ РезервовТМЦ, добавил поле в запрос
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПредварительныйЗаказКлиента.Ссылка КАК Регистратор,
	|	ПредварительныйЗаказКлиента.Дата КАК Период,
	|	ПредварительныйЗаказКлиента.Склад КАК Склад,
	|	ПредварительныйЗаказКлиента.СкладПолучатель КАК СкладПолучатель,
	|	ПредварительныйЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ПредварительныйЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Перемещение) КАК КодОперации,
	|	&Валюта КАК ВалютаДокумента,
	|	&Подразделение КАК Подразделение,
	|	ПредварительныйЗаказКлиентаТовары.НомерЗаказа КАК НомерЗаказа,
	|	ПредварительныйЗаказКлиента.Ссылка КАК Заказ
	|ПОМЕСТИТЬ вт_ПодготовленныеДанныеДвижений
	|ИЗ
	|	Документ.ПредварительныйЗаказКлиента КАК ПредварительныйЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредварительныйЗаказКлиента.Товары КАК ПредварительныйЗаказКлиентаТовары
	|		ПО ПредварительныйЗаказКлиента.Ссылка = ПредварительныйЗаказКлиентаТовары.Ссылка
	|ГДЕ
	|	ПредварительныйЗаказКлиента.Ссылка = &Ссылка
	|	И НЕ ПредварительныйЗаказКлиента.ОтгрузкаКомплектов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредварительныйЗаказКлиента.Ссылка,
	|	ПредварительныйЗаказКлиента.Дата,
	|	ПредварительныйЗаказКлиента.Склад,
	|	ПредварительныйЗаказКлиента.СкладПолучатель,
	|	ПредварительныйЗаказКлиентаКомплектующие.Номенклатура,
	|	ПредварительныйЗаказКлиентаКомплектующие.Количество,
	|	ЗНАЧЕНИЕ(Перечисление.КодыОперацийОстатки.Перемещение),
	|	&Валюта,
	|	&Подразделение,
	|	ПредварительныйЗаказКлиентаКомплектующие.НомерЗаказа,
	|	ПредварительныйЗаказКлиента.Ссылка
	|ИЗ
	|	Документ.ПредварительныйЗаказКлиента КАК ПредварительныйЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПредварительныйЗаказКлиента.Комплектующие КАК ПредварительныйЗаказКлиентаКомплектующие
	|		ПО ПредварительныйЗаказКлиента.Ссылка = ПредварительныйЗаказКлиентаКомплектующие.Ссылка
	|ГДЕ
	|	ПредварительныйЗаказКлиента.Ссылка = &Ссылка
	|	И ПредварительныйЗаказКлиента.ОтгрузкаКомплектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ПодготовленныеДанныеДвижений.Регистратор КАК Регистратор,
	|	вт_ПодготовленныеДанныеДвижений.Период КАК Период,
	|	&ВидДвиженияПриход КАК ВидДвижения,
	|	вт_ПодготовленныеДанныеДвижений.Склад КАК Склад,
	|	вт_ПодготовленныеДанныеДвижений.Номенклатура КАК Номенклатура,
	|	вт_ПодготовленныеДанныеДвижений.Склад.ФизическийСклад КАК Получатель,
	|	вт_ПодготовленныеДанныеДвижений.Количество КАК Количество,
	|	вт_ПодготовленныеДанныеДвижений.Заказ КАК Заказ
	|ИЗ
	|	вт_ПодготовленныеДанныеДвижений КАК вт_ПодготовленныеДанныеДвижений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|		ПО вт_ПодготовленныеДанныеДвижений.НомерЗаказа = ЗаказКлиентаFBSТовары.НомерЗаказа
	|ГДЕ
	|	вт_ПодготовленныеДанныеДвижений.Количество > 0
	|	И ЗаказКлиентаFBSТовары.НомерЗаказа ЕСТЬ NULL");
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка",			   Ссылка);
	Запрос.УстановитьПараметр("Валюта",			   Справочники.Валюты.НайтиПоНаименованию("руб."));
	Запрос.УстановитьПараметр("Подразделение",	   Справочники.Подразделения.НайтиПоНаименованию("Отдел интернет-продаж"));
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	
	Движения.РезервыТМЦ.Загрузить(Запрос.Выполнить().Выгрузить());
	Движения.Записать();
	
	ТекстыОшибок = Новый Массив;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ОстаткиТМЦОстатки.Склад КАК Склад,
	|	ОстаткиТМЦОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТМЦОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ОстаткиТМЦОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ вт_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			&Период,
	|			Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						вт_ПодготовленныеДанныеДвижений.Номенклатура
	|					ИЗ
	|						вт_ПодготовленныеДанныеДвижений)) КАК ОстаткиТМЦОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервыТМЦОстатки.Склад КАК Склад,
	|	РезервыТМЦОстатки.Номенклатура КАК Номенклатура,
	|	РезервыТМЦОстатки.Номенклатура.Представление КАК НоменклатураПредставление,
	|	РезервыТМЦОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ вт_Резервы
	|ИЗ
	|	РегистрНакопления.РезервыТМЦ.Остатки(
	|			&Период,
	|			Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						вт_ПодготовленныеДанныеДвижений.Номенклатура
	|					ИЗ
	|						вт_ПодготовленныеДанныеДвижений)) КАК РезервыТМЦОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Резервы.Склад КАК Склад,
	|	вт_Резервы.Номенклатура КАК Номенклатура,
	|	вт_Резервы.НоменклатураПредставление КАК НоменклатураПредставление,
	|	ЕСТЬNULL(вт_Остатки.КоличествоОстаток, 0) - вт_Резервы.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	вт_Резервы КАК вт_Резервы
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Остатки КАК вт_Остатки
	|		ПО вт_Резервы.Склад = вт_Остатки.Склад
	|			И вт_Резервы.Номенклатура = вт_Остатки.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(вт_Остатки.КоличествоОстаток, 0) - вт_Резервы.КоличествоОстаток < 0";
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени()));
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Если Не ПолучитьПолномочиеПользователя("СписыватьВМинус") Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстыОшибок.Добавить(СтрШаблон("Не хватает товара %1 в количестве %2",
				Выборка.НоменклатураПредставление, -Выборка.КоличествоОстаток));
		КонецЦикла;
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = СтрСоединить(ТекстыОшибок, Символы.ПС);
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаполнитьКоличествоПродукции() Экспорт
	
	// обнуление колонки КоличествоПродукции
	Для Каждого СтрокаТЧ Из Комплектующие Цикл 
		СтрокаТЧ.КоличествоПродукции = 0;
	КонецЦикла;
	
	ТПродукции = Товары.Выгрузить(, "Номенклатура, Количество");
	ТПродукции.Свернуть("Номенклатура", "Количество");
	
	Для Каждого СтрокаТЗ Из ТПродукции Цикл
		СтрокаКомплектующих = Комплектующие.Найти(СтрокаТЗ.Номенклатура, "Продукция");
		Если СтрокаКомплектующих <> Неопределено Тогда
			СтрокаКомплектующих.КоличествоПродукции = СтрокаТЗ.Количество;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти
